{
  "en": {
    "Portable Retro Mini Console": "Portable gaming console with 400+ classic retro games, rechargeable battery, and nostalgic gaming experience.",
    "Smarphone Gamepad Controller": "Universal smartphone gamepad with Bluetooth connectivity, ergonomic design, and precise controls for mobile gaming.",
    "JBL Flip 6 Bluetooth Speaker": "Portable Bluetooth speaker with powerful bass, IP67 waterproof rating, and 12-hour playtime.",
    "Victorinox Swiss Army Knife USB": "Premium Swiss Army knife with integrated USB flash drive, combining traditional tools with modern storage.",
    "XGIMI Horizon Pro Projector": "4K smart projector with 2200 ANSI lumens, Android TV, auto-focus, and immersive home theater experience.",
    "Anki Cozmo Educational Robot": "Interactive AI-powered robot toy for learning coding, robotics, and STEM skills through engaging play.",
    "DJI Mini 3 Pro Drone": "Ultra-light 4K drone with 34-minute flight time, obstacle avoidance, and professional aerial photography capabilities.",
    "USB Desktop Vacuum Cleaner": "Compact USB-powered vacuum for cleaning keyboards, desks, and workspaces with strong suction.",
    "Xbox Elite Wireless Controller": "Premium gaming controller with customizable buttons, adjustable tension thumbsticks, and pro-level precision.",
    "Meta Quest 3 VR Headset": "Next-gen mixed reality headset with 4K+ display, advanced hand tracking, and immersive virtual experiences.",
    "Anker PowerLine III USB-C Cable": "Durable USB-C cable with 35000+ bend lifespan, fast charging, and universal compatibility.",
    "Logitech MX Master 3S": "Advanced wireless mouse with ultra-precise scrolling, ergonomic design, and multi-device connectivity.",
    "Secretlab TITAN Gaming Chair": "Premium ergonomic gaming chair with lumbar support, cold-cure foam, and professional-grade comfort.",
    "Amazon Echo Dot (5th Gen)": "Smart speaker with Alexa voice assistant, improved audio, and seamless smart home control.",
    "HyperX Cloud II Gaming Headset": "Professional gaming headset with 7.1 virtual surround sound, memory foam ear cushions, and detachable mic.",
    "Samsung Odyssey G7 Gaming Monitor": "Curved 240Hz gaming monitor with 1ms response time, QLED display, and G-Sync compatibility.",
    "Elago MS3 Phone Stand": "Minimalist aluminum phone stand with anti-slip padding and elegant design for desk organization.",
    "Sony WF-1000XM5 Earbuds": "Premium noise-cancelling earbuds with exceptional sound quality, 8-hour battery, and adaptive audio.",
    "Spigen Tempered Glass Screen Protector": "Ultra-clear tempered glass with 9H hardness, easy installation, and scratch-resistant protection.",
    "Keychron K8 Mechanical Keyboard": "Wireless mechanical keyboard with hot-swappable switches, RGB backlighting, and Mac/Windows compatibility.",
    "Anker PowerCore 20000mAh": "High-capacity portable charger with dual USB ports, fast charging, and enough power for multiple device charges.",
    "Rain Design mStand Laptop Stand": "Premium aluminum laptop stand with cable management, ergonomic height, and improved cooling.",
    "Apple Watch Series 9": "Advanced smartwatch with health monitoring, fitness tracking, and seamless Apple ecosystem integration.",
    "Fitbit Charge 6": "Fitness tracker with heart rate monitoring, GPS, sleep tracking, and 7-day battery life.",
    "Blue Yeti USB Microphone": "Professional USB microphone for streaming, podcasting, and content creation with studio-quality sound.",
    "PlayStation 5 Console": "Next-gen gaming console with ultra-high speed SSD, stunning 4K graphics, and immersive haptic feedback.",
    "Anker 7-Port USB Hub": "High-speed USB 3.0 hub with 7 ports, individual power switches, and universal device compatibility."
  },
  "es": {
    "Portable Retro Mini Console": "Consola portátil con más de 400 juegos retro clásicos, batería recargable y experiencia de juego nostálgica.",
    "Smarphone Gamepad Controller": "Gamepad universal para smartphone con conectividad Bluetooth, diseño ergonómico y controles precisos para juegos móviles.",
    "JBL Flip 6 Bluetooth Speaker": "Altavoz Bluetooth portátil con graves potentes, resistencia al agua IP67 y 12 horas de reproducción.",
    "Victorinox Swiss Army Knife USB": "Navaja suiza premium con memoria USB integrada, combinando herramientas tradicionales con almacenamiento moderno.",
    "XGIMI Horizon Pro Projector": "Proyector inteligente 4K con 2200 lúmenes ANSI, Android TV, enfoque automático y experiencia de cine en casa inmersiva.",
    "Anki Cozmo Educational Robot": "Robot interactivo con IA para aprender programación, robótica y habilidades STEM a través del juego.",
    "DJI Mini 3 Pro Drone": "Dron ultra ligero 4K con 34 minutos de vuelo, evitación de obstáculos y capacidades profesionales de fotografía aérea.",
    "USB Desktop Vacuum Cleaner": "Aspiradora compacta USB para limpiar teclados, escritorios y espacios de trabajo con potente succión.",
    "Xbox Elite Wireless Controller": "Control gaming premium con botones personalizables, sticks ajustables y precisión de nivel profesional.",
    "Meta Quest 3 VR Headset": "Visor de realidad mixta de próxima generación con pantalla 4K+, seguimiento avanzado de manos y experiencias virtuales inmersivas.",
    "Anker PowerLine III USB-C Cable": "Cable USB-C duradero con más de 35000 dobleces, carga rápida y compatibilidad universal.",
    "Logitech MX Master 3S": "Mouse inalámbrico avanzado con desplazamiento ultra preciso, diseño ergonómico y conectividad multidispositivo.",
    "Secretlab TITAN Gaming Chair": "Silla gaming premium ergonómica con soporte lumbar, espuma de curado en frío y comodidad profesional.",
    "Amazon Echo Dot (5th Gen)": "Altavoz inteligente con asistente Alexa, audio mejorado y control perfecto del hogar inteligente.",
    "HyperX Cloud II Gaming Headset": "Auriculares gaming profesionales con sonido envolvente 7.1, almohadillas de espuma viscoelástica y micrófono desmontable.",
    "Samsung Odyssey G7 Gaming Monitor": "Monitor gaming curvo de 240Hz con tiempo de respuesta de 1ms, pantalla QLED y compatibilidad G-Sync.",
    "Elago MS3 Phone Stand": "Soporte minimalista de aluminio para teléfono con antideslizante y diseño elegante para organizar tu escritorio.",
    "Sony WF-1000XM5 Earbuds": "Auriculares premium con cancelación de ruido, calidad de sonido excepcional, batería de 8 horas y audio adaptativo.",
    "Spigen Tempered Glass Screen Protector": "Cristal templado ultra claro con dureza 9H, instalación fácil y protección resistente a rayones.",
    "Keychron K8 Mechanical Keyboard": "Teclado mecánico inalámbrico con switches intercambiables en caliente, retroiluminación RGB y compatibilidad Mac/Windows.",
    "Anker PowerCore 20000mAh": "Cargador portátil de alta capacidad con puertos USB duales, carga rápida y energía suficiente para múltiples cargas.",
    "Rain Design mStand Laptop Stand": "Soporte premium de aluminio para laptop con gestión de cables, altura ergonómica y mejor refrigeración.",
    "Apple Watch Series 9": "Smartwatch avanzado con monitoreo de salud, seguimiento fitness e integración perfecta con el ecosistema Apple.",
    "Fitbit Charge 6": "Rastreador de fitness con monitoreo de frecuencia cardíaca, GPS, seguimiento de sueño y batería de 7 días.",
    "Blue Yeti USB Microphone": "Micrófono USB profesional para streaming, podcasting y creación de contenido con sonido de calidad de estudio.",
    "PlayStation 5 Console": "Consola de juegos de próxima generación con SSD de ultra alta velocidad, gráficos 4K impresionantes y retroalimentación háptica inmersiva.",
    "Anker 7-Port USB Hub": "Hub USB 3.0 de alta velocidad con 7 puertos, interruptores de encendido individuales y compatibilidad universal."
  }
}

